web/backend/views/classify/_form.php


    <?php $form = ActiveForm::begin(); ?>

    <?= $form->field($model, 'pid')->dropDownList(ArrayHelper::map( Classify::find()->where("pid=1")->all(),'id','title'),['prompt'=>'选择一级分类',])?>
---
SELECT * FROM `classify` WHERE pid=1