web/backend/controllers/ClassifyController.php

INSERT INTO `classify` (`pid`, `title`) VALUES (0, '水果')
---
    public function actionCreate()
    {
        $model = new Classify();

        if ($model->load(Yii::$app->request->post()))
        {
        	$title = explode(" ", $model->title);
        	if(count($title) > 1)
        	{
        		foreach ($title as $k => $v)
        		{
        			$child = new Classify();
        			$child->pid = $model->pid;
        			$child->title = $v;
        			$child->save();

SELECT * FROM `classify` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Classify::findOne($id)) !== null) {