web/common/models/User.php

SELECT * FROM `user` WHERE (`uid`=1) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['uid' => $id, 'status' => self::STATUS_ACTIVE]);