web/frontend/modules/ucenter/controllers/DefaultController.php

    public function actionUpdate()
    {
    	//$user = User::findById(\Yii::$app->user->id);
    	$userexpand = UserExpand::findById(\Yii::$app->user->id);
    	if(empty($userexpand))
    		$userexpand = new UserExpand();
    	//默认uid
    	$userexpand->uid = \Yii::$app->user->id;
    	if ($userexpand->load(Yii::$app->request->post()))
    	{
    		if($userexpand->save())
---
UPDATE `user_expand` SET `gender`=0, `birthday`=0, `qq`='281696509', `province`=120000, `city`=120100, `county`=120102 WHERE `uid`=1