web/frontend/models/Areas.php

SELECT * FROM `areas` WHERE `id`=120000
---
	public static function findById($id)
	{
		return self::findOne(['id' => $id]);

SELECT * FROM `areas` WHERE `pid`=411500
---
	public static function getAllByCondition($condition, $order, $limit, $pagesize = 10)
	{
		$query = self::find()->where($condition);

		$countQuery = clone $query;
		$pages = new Pagination(['totalCount' => $countQuery->count(), 'defaultPageSize' => $pagesize]);
		$models = $query->offset($pages->offset)
										->orderBy($order)
										->limit($limit)
										->indexBy("uniqid")
										->asArray()
										->all();