web/frontend/models/Company.php

SELECT * FROM `company` WHERE `uid`=1
---
	public static function getCompanyByUid($uid)
	{
		return self::find()->where(['uid' => $uid])->asArray()->one();