web/frontend/models/Goods.php

	public static function findById($id)
	{
		return self::findOne(['id' => $id]);
---
SELECT * FROM `goods` WHERE `id`='2'

	public static function getGoodsByGoodsId($goods_id)
	{
		if(empty($goods_id)) return null;
		$info = self::find()->where(['id' => $goods_id, 'status' => 1])->asArray()->indexBy("id")->all();
---
SELECT * FROM `goods` WHERE (`id` IN ('2', '2', '3', '2', '2')) AND (`status`=1)