web/frontend/models/GoodsTrace.php

SELECT COUNT(*) FROM `goods_trace` WHERE `goods_id`='2'
---
	public static function getAllByCondition($condition, $order, $pagesize = 10)
	{
		$query = self::find()->where($condition);

		$countQuery = clone $query;
		$pages = new Pagination(['totalCount' => $countQuery->count(), 'defaultPageSize' => $pagesize]);
		$models = $query->offset($pages->offset)
										->orderBy($order)
										->indexBy("id")
										->asArray()
										->all();