web/frontend/models/UserCertification.php

	public static function getInfoByUidAndType($uid, $type)
	{
		return self::find()->where(['uid' => $uid, 'type' => $type])->one();
---
SELECT * FROM `user_certification` WHERE (`uid`=1) AND (`type`=0)