web/frontend/models/User.php

	public static function findById($uid)
	{
		if (($model = User::findOne(['uid' => $uid])) !== null)
---
SELECT * FROM `user` WHERE `uid`=1

	public static function getUsersByUids($uids)
	{
		if(empty($uids)) return null;
		$uids = is_array($uids) ? $uids : [$uids];

		return self::find()->select(self::tableName(). ".uid, username, email, mobile, role, user_expand.photo")->where([self::tableName(). '.uid' => $uids])->leftJoin("user_expand", "user_expand.uid=" .self::tableName(). ".uid")->indexBy("uid")->asArray()->all();
---
SELECT `user`.`uid`, `username`, `email`, `mobile`, `role`, `user_expand`.`photo` FROM `user` LEFT JOIN `user_expand` ON user_expand.uid=user.uid WHERE `user`.`uid` IN ('1', '1', '1', '1', '1')