web/frontend/models/UserExpand.php

	public static function findById($uid)
	{
		return self::findOne(['uid' => $uid]);
---
SELECT * FROM `user_expand` WHERE `uid`=1